Revit 2026 API

# AnalysisResultSchema Methods

---

The AnalysisResultSchema type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetNumberOfUnits | returns number of possible units |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUnitsMultiplier | returns units multiplier by index |
|  | GetUnitsName | returns units name by index |
|  | IsEqual | Determines if the input object is equivalent to this AnalysisResultSchema. |
|  | SetUnits |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace